Show / Hide Table of Contents
Class ConcreteMemberDataEc2
Concrete member data Ec2
Inheritance
System.Object
OpenObject
OpenAttribute
ConcreteMemberData
ConcreteMemberDataEc2
Inherited Members
 ConcreteMemberData.MemberType
 ConcreteMemberData.TwoWaySlabType
 ConcreteMemberData.TimeAxis
 ConcreteMemberData.CalculationSetup
 OpenAttribute.Element
 System.Object.ToString()
 System.Object.Equals(System.Object)
 System.Object.Equals(System.Object, System.Object)
 System.Object.ReferenceEquals(System.Object, System.Object)
 System.Object.GetHashCode()
 System.Object.GetType()
 System.Object.MemberwiseClone()
Namespace: IdeaRS.OpenModel.Concrete
Assembly: IdeaRS.OpenModel.dll
Syntax
[OpenModelClass("CI.Services.MemberData.Concrete.Ec2.ConcreteMemberDataEc2,CI.ConcreteSetup")]
public class ConcreteMemberDataEc2 : ConcreteMemberData
Constructors
Improve this Doc   View Source
ConcreteMemberDataEc2()
Constructor
Declaration
public ConcreteMemberDataEc2()
Properties
Improve this Doc   View Source
BeamData
Beam data
Declaration
public BeamDataEc2 BeamData { get; set; }
Property Value
 Type |  Description
 BeamDataEc2
Improve this Doc   View Source
CoeffKxForWmax
coefficient kx to increase limited concrete crack - only Dutch NAD
Declaration
public double CoeffKxForWmax { get; set; }
Property Value
 Type |  Description
 System.Double
Improve this Doc   View Source
ColumnData
Column data
Declaration
public ColumnDataEc2 ColumnData { get; set; }
Property Value
 Type |  Description
 ColumnDataEc2
Improve this Doc   View Source
CreepCoeffInfinity
Gets or sets the user defined creep coefficient in infinity. If null, then we calculate them.
Declaration
public double CreepCoeffInfinity { get; set; }
Property Value
 Type |  Description
 System.Double
Improve this Doc   View Source
CreepCoeffInfinityValue
type of creep coefficient
Declaration
public InputValue CreepCoeffInfinityValue { get; set; }
Property Value
 Type |  Description
 InputValue
Improve this Doc   View Source
DeflectionRequirement
gets or set deflection requirement for deflection calculation
Declaration
public DeflectionRequirementEc2 DeflectionRequirement { get; set; }
Property Value
 Type |  Description
 DeflectionRequirementEc2
Improve this Doc   View Source
ExposureClassesData
Exposure classes
Declaration
public ExposureClassesDataEc2 ExposureClassesData { get; set; }
Property Value
 Type |  Description
 ExposureClassesDataEc2
Improve this Doc   View Source
MemberImportance
Gets or sets the member importance.
Declaration
public MemberImportance MemberImportance { get; set; }
Property Value
 Type |  Description
 MemberImportance
Improve this Doc   View Source
RelativeHumidity
Gets or sets the surrounding relative humidity.
Declaration
public double RelativeHumidity { get; set; }
Property Value
 Type |  Description
 System.Double
 Improve this Doc
 View Source